#1

# სიის შექმნა
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# სიის სიგრძის გამოთვლა და დაბეჭდვა
print("სიის სიგრძე არის:", len(my_list))



#2


# სიის შექმნა
my_list = ['ა', 'ბ', 'გ', 'დ', 'ე', 'ვ', 'ზ', 'თ', 'ი', 'კ']

# for ციკლით თითოეული ელემენტის დაბეჭდვა ინდექსით
for i in range(len(my_list)):
    print(f"ელემენტი {i + 1}: {my_list[i]}")



#3


# სიის შექმნა
my_list = [1, 2, 3, 4, 5]

# .append() ფუნქციის გამოყენებით ორი ახალი ელემენტის დამატება
my_list.append(6)  # სიას ემატება 6
my_list.append(7)  # სიას ემატება 7

print("განახლებული სია:", my_list)



#4


# ცარიელი სიის შექმნა
new_list = []

# for ციკლით ინდექსების გადალახვა და სიის შევსება
for i in range(1, 11):  # i ცვლადი მიიღებს 1-დან 10-მდე მნიშვნელობას
    new_list.append(i)  # i-ის დამატება სიაში

print("სია საიტერაციო ცვლადით შევსების შემდეგ:", new_list)






