#1. შექმენი ფუნცია, სადაც არგუმენტად გადასცემ ორ რიცხვს, შემდეგ დაპრინტე ამ ორი რიიცხვის განაყოფი.
#2. შექმენი ფუნქცია, სადაც არგუმენტად გადასცემ დაბადების თარიღს, შემდეგ დაპრინტე თუ რამდენი წლისაა მომხმარებელი.
#3. შექმენი ფუნქცია, სადაც არგუმენტად გადასცემ რიცხვ, შემდეგ დაპრინტე ეს რიცხვი გამრავლებული 5-ზე.



#1)


def divide_numbers(num1, num2):
    if num2 != 0:  # თავიდან ვამოწმებთ, რომ მეორე რიცხვი არ იყოს ნული
        print(num1 / num2)
    else:
        print("Cannot divide by zero")


#3)


def multiply_by_5(number):
    print(number * 5)
